app/views/users/show.html.erb

			<div class="container-lg">
				<% @user.images.each do |image| %>
---
SELECT "images".* FROM "images" INNER JOIN "users_images" ON "images"."id" = "users_images"."image_id" WHERE "users_images"."user_id" = ?  [["user_id", 20]]

				<% else %>
					<% @user.images.accepted.each do |image| %>
---
SELECT "images".* FROM "images" INNER JOIN "users_images" ON "images"."id" = "users_images"."image_id" WHERE "users_images"."user_id" = ? AND "images"."accepted" = ?  [["user_id", 20], ["accepted", 1]]