app/views/battles/show.html.erb


<%  @battle.rounds.each do |round|%>
---
SELECT "rounds".* FROM "rounds" WHERE "rounds"."battle_id" = ?  [["battle_id", 1]]