app/controllers/application_controller.rb

	def belongs_to_user?
		current_user.images.ids.include?(@image.id)
---
SELECT "images"."id" FROM "images" INNER JOIN "users_images" ON "images"."id" = "users_images"."image_id" WHERE "users_images"."user_id" = ?  [["user_id", 20]]