app/controllers/battles_controller.rb

	def show
		@battle = Battle.find(params[:id])
---
SELECT "battles".* FROM "battles" WHERE "battles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def index
		@battles = Battle.all
---
SELECT "battles".* FROM "battles"