app/controllers/battlers_controller.rb

	def show
		@battler = Battler.find(params[:id])
---
SELECT "battlers".* FROM "battlers" WHERE "battlers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def index
		@battlers = Battler.all
---
SELECT "battlers".* FROM "battlers"