app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."accepted" = ? ORDER BY "images"."id" ASC LIMIT ?  [["accepted", 0], ["LIMIT", 1]]
---
	def index
		@images = Image.accepted.all

UPDATE "images" SET "updated_at" = ?, "accepted" = ? WHERE "images"."id" = ?  [["updated_at", "2021-11-30 00:20:10.874677"], ["accepted", 1], ["id", 4]]
---
	def update
		if @image.update(image_params)

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def set_image
		@image = Image.find(params[:id])