app/controllers/images_controller.rb

	def accept_image
		@image.accepted = true
		@image.save
---
UPDATE "images" SET "updated_at" = ?, "accepted" = ? WHERE "images"."id" = ?  [["updated_at", "2021-12-02 01:27:46.521391"], ["accepted", 1], ["id", 3]]