app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
	def home #rename to index!!!!!!!!!!!!!!!!!!!!!!!
		@users = User.all