app/controllers/pages_controller.rb

	def index
		redirect_to battles_path if logged_in?
		@users = User.paginate(page: params[:page], per_page: 7)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"