app/controllers/rounds_controller.rb

	def show
		@round = Round.find(params[:id])
---
SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]