app/controllers/users_controller.rb

	def index
		@users = User.paginate(page: params[:page], per_page: 9)
---
SELECT COUNT(*) FROM "users"

	def update
		if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Svetlana"], ["updated_at", "2021-11-24 23:26:16.083938"], ["id", 19]]