app/views/images/show.html.erb

		<div class= "text-dark text-muted">
			Uploaded by <%= User.find(@image.uploaded_by).username %>
---
SELECT "users".* FROM "users" INNER JOIN "users_images" ON "users"."id" = "users_images"."user_id" WHERE "users_images"."image_id" = ?  [["image_id", 3]]

	<% end %>
	<% if @image.users.any? %>
---
SELECT "users".* FROM "users" INNER JOIN "users_images" ON "users"."id" = "users_images"."user_id" WHERE "users_images"."image_id" = ?  [["image_id", 4]]
SELECT 1 AS one FROM "users" INNER JOIN "users_images" ON "users"."id" = "users_images"."user_id" WHERE "users_images"."image_id" = ? LIMIT ?  [["image_id", 4], ["LIMIT", 1]]